app/views/posts/_profile.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
						<p class="heading"><%= t('post_count') %></p>
						<p class="title is-6"><%= current_user.posts.count %></p>