app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("post", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["post", " "], ["created_at", "2018-12-27 07:52:24.559506"], ["updated_at", "2018-12-27 07:52:24.559506"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "post" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post", "ЯСЕГОДНЯОЧЕНЬНАДЕЮСЬСДАТЬЛАБЫ"], ["updated_at", "2018-12-27 05:51:47.896476"], ["id", 29]]